levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_emb.c
/**
 *******************************************************************************
 * @file  hc32m423_emb.c
 * @brief This file provides firmware functions to manage the EMB
 *        (Emergency Brake).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-01-01       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_emb.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_EMB EMB
 * @brief Emergency Brake Driver Library
 * @{
 */

#if (DDL_EMB_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EMB_Local_Macros EMB Local Macros
 * @{
 */

/**
 * @defgroup EMB_Check_Parameters_Validity EMB Check Parameters Validity
 * @{
 */

#define IS_VALID_EMB_GROUP(x)                                                  \
(   ((x) == EMB_GROUP0_TMR4)                    ||                             \
    ((x) == EMB_GROUP1_TMRB))

#define IS_VALID_EMB_CMP1_SEL(x)                                               \
(   ((x) == EMB_CMP1_ENABLE)                    ||                             \
    ((x) == EMB_CMP1_DISABLE))

#define IS_VALID_EMB_CMP2_SEL(x)                                               \
(   ((x) == EMB_CMP2_ENABLE)                    ||                             \
    ((x) == EMB_CMP2_DISABLE))

#define IS_VALID_EMB_CMP3_SEL(x)                                               \
(   ((x) == EMB_CMP3_ENABLE)                    ||                             \
    ((x) == EMB_CMP3_DISABLE))

#define IS_VALID_EMB_OSC_SEL(x)                                                \
(   ((x) == EMB_OSC_ENABLE)                     ||                             \
    ((x) == EMB_OSC_DISABLE))

#define IS_VALID_EMB_TMR4_PWMU_SEL(x)                                          \
(   ((x) == EMB_TMR4_PWMU_ENABLE)               ||                             \
    ((x) == EMB_TMR4_PWMU_DISABLE))

#define IS_VALID_EMB_TMR4_PWMV_SEL(x)                                          \
(   ((x) == EMB_TMR4_PWMV_ENABLE)               ||                             \
    ((x) == EMB_TMR4_PWMV_DISABLE))

#define IS_VALID_EMB_TMR4_PWMW_SEL(x)                                          \
(   ((x) == EMB_TMR4_PWMW_ENABLE)               ||                             \
    ((x) == EMB_TMR4_PWMW_DISABLE))

#define IS_VALID_EMB_PORT_EMBIN1_SEL(x)                                        \
(   ((x) == EMB_PORT_EMBIN1_ENABLE)             ||                             \
    ((x) == EMB_PORT_EMBIN1_DISABLE))

#define IS_VALID_EMB_PORT_EMBIN2_SEL(x)                                        \
(   ((x) == EMB_PORT_EMBIN2_ENABLE)             ||                             \
    ((x) == EMB_PORT_EMBIN2_DISABLE))

#define IS_VALID_EMB_PORT_EMBIN3_SEL(x)                                        \
(   ((x) == EMB_PORT_EMBIN3_ENABLE)             ||                             \
    ((x) == EMB_PORT_EMBIN3_DISABLE))

#define IS_VALID_EMB_PORT_EMBIN1_LEVEL(x)                                      \
(   ((x) == EMB_PORT_EMBIN1_LEVEL_HIGH)         ||                             \
    ((x) == EMB_PORT_EMBIN1_LEVEL_LOW))

#define IS_VALID_EMB_PORT_EMBIN2_LEVEL(x)                                      \
(   ((x) == EMB_PORT_EMBIN2_LEVEL_HIGH)         ||                             \
    ((x) == EMB_PORT_EMBIN2_LEVEL_LOW))

#define IS_VALID_EMB_PORT_EMBIN3_LEVEL(x)                                      \
(   ((x) == EMB_PORT_EMBIN3_LEVEL_HIGH)         ||                             \
    ((x) == EMB_PORT_EMBIN3_LEVEL_LOW))

#define IS_VALID_EMB_DETECT_TIMER4_PWMU_LEVEL(x)                               \
(   ((x) == EMB_DETECT_TIMER4_PWMU_LEVEL_LOW)   ||                             \
    ((x) == EMB_DETECT_TIMER4_PWMU_LEVEL_HIGH))

