levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_emb.c
#define IS_VALID_EMB_DETECT_TIMER4_PWMV_LEVEL(x)                               \
(   ((x) == EMB_DETECT_TIMER4_PWMV_LEVEL_LOW)   ||                             \
    ((x) == EMB_DETECT_TIMER4_PWMV_LEVEL_HIGH))

#define IS_VALID_EMB_DETECT_TIMER4_PWMW_LEVEL(x)                               \
(   ((x) == EMB_DETECT_TIMER4_PWMW_LEVEL_LOW)   ||                             \
    ((x) == EMB_DETECT_TIMER4_PWMW_LEVEL_HIGH))

#define IS_VALID_EMB_SET_TMRB_PWM_OUTPUT_STATE(x)                              \
(   ((x) == EMB_SET_TMRB_PWM_OUTPUT_NORMAL)     ||                             \
    ((x) == EMB_SET_TMRB_PWM_OUTPUT_HIZ)        ||                             \
    ((x) == EMB_SET_TMRB_PWM_OUTPUT_LOW)        ||                             \
    ((x) == EMB_SET_TMRB_PWM_OUTPUT_HIGH))

#define IS_VALID_EMB_PORT_EMBIN1_FILTER_DIV(x)                                 \
(   ((x) == EMB_PORT_EMBIN1_FILTER_NONE)        ||                             \
    ((x) == EMB_PORT_EMBIN1_FILTER_CLK_DIV1)    ||                             \
    ((x) == EMB_PORT_EMBIN1_FILTER_CLK_DIV8)    ||                             \
    ((x) == EMB_PORT_EMBIN1_FILTER_CLK_DIV32)   ||                             \
    ((x) == EMB_PORT_EMBIN1_FILTER_CLK_DIV128))

#define IS_VALID_EMB_PORT_EMBIN2_FILTER_DIV(x)                                 \
(   ((x) == EMB_PORT_EMBIN2_FILTER_NONE)        ||                             \
    ((x) == EMB_PORT_EMBIN2_FILTER_CLK_DIV1)    ||                             \
    ((x) == EMB_PORT_EMBIN2_FILTER_CLK_DIV8)    ||                             \
    ((x) == EMB_PORT_EMBIN2_FILTER_CLK_DIV32)   ||                             \
    ((x) == EMB_PORT_EMBIN2_FILTER_CLK_DIV128))

#define IS_VALID_EMB_PORT_EMBIN3_FILTER_DIV(x)                                 \
(   ((x) == EMB_PORT_EMBIN3_FILTER_NONE)        ||                             \
    ((x) == EMB_PORT_EMBIN3_FILTER_CLK_DIV1)    ||                             \
    ((x) == EMB_PORT_EMBIN3_FILTER_CLK_DIV8)    ||                             \
    ((x) == EMB_PORT_EMBIN3_FILTER_CLK_DIV32)   ||                             \
    ((x) == EMB_PORT_EMBIN3_FILTER_CLK_DIV128))

#define IS_VALID_EMB_INT(x)                                                    \
(   ((x) == EMB_INT_PWM)                        ||                             \
    ((x) == EMB_INT_CMP)                        ||                             \
    ((x) == EMB_INT_OSC)                        ||                             \
    ((x) == EMB_INT_PORT_EMBIN1)                ||                             \
    ((x) == EMB_INT_PORT_EMBIN2)                ||                             \
    ((x) == EMB_INT_PORT_EMBIN3))

#define IS_VALID_EMB_FLAG(x)                                                   \
(   ((x) == EMB_FLAG_PWM)                       ||                             \
    ((x) == EMB_FLAG_CMP)                       ||                             \
    ((x) == EMB_FLAG_OSC)                       ||                             \
    ((x) == EMB_FLAG_PORT_EMBIN1)               ||                             \
    ((x) == EMB_FLAG_PORT_EMBIN2)               ||                             \
    ((x) == EMB_FLAG_PORT_EMBIN3)               ||                             \
    ((x) == EMB_FLAG_PWM_STATE)                 ||                             \
    ((x) == EMB_FLAG_PORT_EMBIN1_STATE)         ||                             \
    ((x) == EMB_FLAG_PORT_EMBIN2_STATE)         ||                             \
    ((x) == EMB_FLAG_PORT_EMBIN3_STATE))

/**
 * @}
 */

/**
 * @defgroup EMB_Groupx_Register_Base_Address EMB Groupx Register Base Address(x = 0 ~ 1)
 * @brief Get the specified EMB group register base address
 * @{
 */
#define EMB_GROUPx_BASE_ADDRESS(__GROUP__)    ((uint32_t)M4_EMB + ((uint32_t)(__GROUP__))*0x20UL)
/**
 * @}
 */

/**
 * @defgroup EMB_Groupx_Register EMB Groupx Register (x = 0 ~ 1)
 * @brief Get the specified EMB group register
 * @{
 */
#define EMB_CTLx(__GROUP__)        ((volatile uint32_t *)(EMB_GROUPx_BASE_ADDRESS(__GROUP__) + 0x00UL))
#define EMB_PWMLVx(__GROUP__)      ((volatile uint32_t *)(EMB_GROUPx_BASE_ADDRESS(__GROUP__) + 0x04UL))
#define EMB_SOEx(__GROUP__)        ((volatile uint32_t *)(EMB_GROUPx_BASE_ADDRESS(__GROUP__) + 0x08UL))
#define EMB_STATx(__GROUP__)       ((volatile uint32_t *)(EMB_GROUPx_BASE_ADDRESS(__GROUP__) + 0x0CUL))
#define EMB_STATCLRx(__GROUP__)    ((volatile uint32_t *)(EMB_GROUPx_BASE_ADDRESS(__GROUP__) + 0x10UL))
#define EMB_INTENx(__GROUP__)      ((volatile uint32_t *)(EMB_GROUPx_BASE_ADDRESS(__GROUP__) + 0x14UL))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup EMB_Global_Functions EMB Global Functions
 * @{
 */

/**
 * @brief  Initialize EMB group0.
 * @param  [in] pstcInit                Pointer to a @ref stc_emb_group0_timer4_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EMB_Group0Timer4Init(const stc_emb_group0_timer4_init_t *pstcInit)
{
    uint32_t u32Ctl = 0UL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_EMB_CMP1_SEL(pstcInit->u32Cmp1Enable));
        DDL_ASSERT(IS_VALID_EMB_CMP2_SEL(pstcInit->u32Cmp2Enable));
        DDL_ASSERT(IS_VALID_EMB_CMP3_SEL(pstcInit->u32Cmp3Enable));
        DDL_ASSERT(IS_VALID_EMB_OSC_SEL(pstcInit->u32OscEnable));
        DDL_ASSERT(IS_VALID_EMB_TMR4_PWMU_SEL(pstcInit->stcTimer4.u32Timer4PwmUEnable));
        DDL_ASSERT(IS_VALID_EMB_TMR4_PWMV_SEL(pstcInit->stcTimer4.u32Timer4PwmVEnable));
        DDL_ASSERT(IS_VALID_EMB_TMR4_PWMW_SEL(pstcInit->stcTimer4.u32Timer4PwmWEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN1_SEL(pstcInit->stcEmbIn1.u32PortEmbInEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN1_LEVEL(pstcInit->stcEmbIn1.u32PortEmbInLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN1_FILTER_DIV(pstcInit->stcEmbIn1.u32PortEmbInFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN2_SEL(pstcInit->stcEmbIn2.u32PortEmbInEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN2_LEVEL(pstcInit->stcEmbIn2.u32PortEmbInLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN2_FILTER_DIV(pstcInit->stcEmbIn2.u32PortEmbInFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN3_SEL(pstcInit->stcEmbIn3.u32PortEmbInEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN3_LEVEL(pstcInit->stcEmbIn3.u32PortEmbInLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN3_FILTER_DIV(pstcInit->stcEmbIn3.u32PortEmbInFilterDiv));

        /* Set default value */
        WRITE_REG32(M4_EMB->STATCLR0, 0x0Ful);
        WRITE_REG32(M4_EMB->INTEN0, 0x00UL);
        WRITE_REG32(M4_EMB->SOE0, 0x00UL);

        u32Ctl = pstcInit->u32Cmp1Enable | \
                 pstcInit->u32Cmp2Enable | \
                 pstcInit->u32Cmp3Enable | \
                 pstcInit->u32OscEnable | \
                 pstcInit->stcTimer4.u32Timer4PwmUEnable | \
                 pstcInit->stcTimer4.u32Timer4PwmVEnable | \
                 pstcInit->stcTimer4.u32Timer4PwmWEnable | \
                 pstcInit->stcEmbIn1.u32PortEmbInEnable | \
                 pstcInit->stcEmbIn1.u32PortEmbInLevel | \
                 pstcInit->stcEmbIn1.u32PortEmbInFilterDiv | \
                 pstcInit->stcEmbIn2.u32PortEmbInEnable | \
                 pstcInit->stcEmbIn2.u32PortEmbInLevel | \
                 pstcInit->stcEmbIn2.u32PortEmbInFilterDiv | \
                 pstcInit->stcEmbIn3.u32PortEmbInEnable | \
                 pstcInit->stcEmbIn3.u32PortEmbInLevel | \
                 pstcInit->stcEmbIn3.u32PortEmbInFilterDiv;

        WRITE_REG32(M4_EMB->CTL0, u32Ctl);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_emb_group0_timer4_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_emb_group0_timer4_init_t structure (M4_EMB unit function configuration data structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EMB_Group0Timer4StructInit(stc_emb_group0_timer4_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

