levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_emb.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Cmp1Enable = EMB_CMP1_DISABLE;
        pstcInit->u32Cmp2Enable = EMB_CMP2_DISABLE;
        pstcInit->u32Cmp3Enable = EMB_CMP3_DISABLE;

        pstcInit->u32OscEnable = EMB_OSC_DISABLE;

        pstcInit->stcTimer4.u32Timer4PwmUEnable = EMB_TMR4_PWMU_DISABLE;
        pstcInit->stcTimer4.u32Timer4PwmVEnable = EMB_TMR4_PWMV_DISABLE;
        pstcInit->stcTimer4.u32Timer4PwmWEnable = EMB_TMR4_PWMW_DISABLE;

        pstcInit->stcEmbIn1.u32PortEmbInFilterDiv = EMB_PORT_EMBIN1_FILTER_NONE;
        pstcInit->stcEmbIn1.u32PortEmbInLevel = EMB_PORT_EMBIN1_LEVEL_HIGH;
        pstcInit->stcEmbIn1.u32PortEmbInEnable = EMB_PORT_EMBIN1_DISABLE;

        pstcInit->stcEmbIn2.u32PortEmbInFilterDiv = EMB_PORT_EMBIN2_FILTER_NONE;
        pstcInit->stcEmbIn2.u32PortEmbInLevel = EMB_PORT_EMBIN2_LEVEL_HIGH;
        pstcInit->stcEmbIn2.u32PortEmbInEnable = EMB_PORT_EMBIN2_DISABLE;

        pstcInit->stcEmbIn3.u32PortEmbInFilterDiv = EMB_PORT_EMBIN3_FILTER_NONE;
        pstcInit->stcEmbIn3.u32PortEmbInLevel = EMB_PORT_EMBIN3_LEVEL_HIGH;
        pstcInit->stcEmbIn3.u32PortEmbInEnable = EMB_PORT_EMBIN3_DISABLE;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize EMB group1.
 * @param  [in] pstcInit                Pointer to a @ref stc_emb_group1_timerb_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EMB_Group1TimerbInit(const stc_emb_group1_timerb_init_t *pstcInit)
{
    uint32_t u32Ctl = 0UL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_EMB_CMP1_SEL(pstcInit->u32Cmp1Enable));
        DDL_ASSERT(IS_VALID_EMB_CMP2_SEL(pstcInit->u32Cmp2Enable));
        DDL_ASSERT(IS_VALID_EMB_CMP3_SEL(pstcInit->u32Cmp3Enable));
        DDL_ASSERT(IS_VALID_EMB_OSC_SEL(pstcInit->u32OscEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN1_SEL(pstcInit->stcEmbIn1.u32PortEmbInEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN1_LEVEL(pstcInit->stcEmbIn1.u32PortEmbInLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN1_FILTER_DIV(pstcInit->stcEmbIn1.u32PortEmbInFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN2_SEL(pstcInit->stcEmbIn2.u32PortEmbInEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN2_LEVEL(pstcInit->stcEmbIn2.u32PortEmbInLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN2_FILTER_DIV(pstcInit->stcEmbIn2.u32PortEmbInFilterDiv));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN3_SEL(pstcInit->stcEmbIn3.u32PortEmbInEnable));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN3_LEVEL(pstcInit->stcEmbIn3.u32PortEmbInLevel));
        DDL_ASSERT(IS_VALID_EMB_PORT_EMBIN3_FILTER_DIV(pstcInit->stcEmbIn3.u32PortEmbInFilterDiv));

        /* Set default value */
        WRITE_REG32(M4_EMB->STATCLR1, 0x0Ful);
        WRITE_REG32(M4_EMB->INTEN1, 0x00UL);
        WRITE_REG32(M4_EMB->SOE1, 0x00UL);

        u32Ctl = pstcInit->u32Cmp1Enable | \
                 pstcInit->u32Cmp2Enable | \
                 pstcInit->u32Cmp3Enable | \
                 pstcInit->u32OscEnable | \
                 pstcInit->stcEmbIn1.u32PortEmbInEnable | \
                 pstcInit->stcEmbIn1.u32PortEmbInLevel | \
                 pstcInit->stcEmbIn1.u32PortEmbInFilterDiv | \
                 pstcInit->stcEmbIn2.u32PortEmbInEnable | \
                 pstcInit->stcEmbIn2.u32PortEmbInLevel | \
                 pstcInit->stcEmbIn2.u32PortEmbInFilterDiv | \
                 pstcInit->stcEmbIn3.u32PortEmbInEnable | \
                 pstcInit->stcEmbIn3.u32PortEmbInLevel | \
                 pstcInit->stcEmbIn3.u32PortEmbInFilterDiv;

        WRITE_REG32(M4_EMB->CTL1, u32Ctl);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_emb_group1_timerb_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_emb_group1_timerb_init_t structure (M4_EMB unit function configuration data structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EMB_Group1TimerbStructInit(stc_emb_group1_timerb_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Cmp1Enable = EMB_CMP1_DISABLE;
        pstcInit->u32Cmp2Enable = EMB_CMP2_DISABLE;
        pstcInit->u32Cmp3Enable = EMB_CMP3_DISABLE;

        pstcInit->u32OscEnable = EMB_OSC_DISABLE;

        pstcInit->stcEmbIn1.u32PortEmbInFilterDiv = EMB_PORT_EMBIN1_FILTER_NONE;
        pstcInit->stcEmbIn1.u32PortEmbInLevel = EMB_PORT_EMBIN1_LEVEL_HIGH;
        pstcInit->stcEmbIn1.u32PortEmbInEnable = EMB_PORT_EMBIN1_DISABLE;

        pstcInit->stcEmbIn2.u32PortEmbInFilterDiv = EMB_PORT_EMBIN2_FILTER_NONE;
        pstcInit->stcEmbIn2.u32PortEmbInLevel = EMB_PORT_EMBIN2_LEVEL_HIGH;
        pstcInit->stcEmbIn2.u32PortEmbInEnable = EMB_PORT_EMBIN2_DISABLE;

        pstcInit->stcEmbIn3.u32PortEmbInFilterDiv = EMB_PORT_EMBIN3_FILTER_NONE;
        pstcInit->stcEmbIn3.u32PortEmbInLevel = EMB_PORT_EMBIN3_LEVEL_HIGH;
        pstcInit->stcEmbIn3.u32PortEmbInEnable = EMB_PORT_EMBIN3_DISABLE;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize EMB function
 * @param  [in] u32Group                EMB group
 *         This parameter can be one of the following values:
 *           @arg EMB_GROUP0_TMR4:      EMB group 0 for Timer4
 *           @arg EMB_GROUP1_TMRB:      EMB group 1 for TimerB
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 */
en_result_t EMB_DeInit(uint32_t u32Group)
{
    __IO uint32_t *EMB_SOE = EMB_SOEx(u32Group);
    __IO uint32_t *EMB_INTEN = EMB_INTENx(u32Group);
    __IO uint32_t *EMB_STATCLR = EMB_STATCLRx(u32Group);

    DDL_ASSERT(IS_VALID_EMB_GROUP(u32Group));

