levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_emb.c
    /* Configures the registers to reset value. */
    WRITE_REG32(*EMB_STATCLR, 0x0FUL);
    WRITE_REG32(*EMB_INTEN, 0x00UL);
    WRITE_REG32(*EMB_SOE, 0x00UL);

    return Ok;
}

/**
 * @brief  Set EMB detection port level
 * @param  [in] stcPwmLevel             Timer4 PWM level a @ref stc_emb_timer4_pwm_level_t structure
 * @retval None
 */
void EMB_SetDetectTimer4PwmLevel(stc_emb_timer4_pwm_level_t stcPwmLevel)
{
    uint32_t u32Pwmlv0;

    DDL_ASSERT(IS_VALID_EMB_DETECT_TIMER4_PWMU_LEVEL(stcPwmLevel.u32PwmULvl));
    DDL_ASSERT(IS_VALID_EMB_DETECT_TIMER4_PWMV_LEVEL(stcPwmLevel.u32PwmVLvl));
    DDL_ASSERT(IS_VALID_EMB_DETECT_TIMER4_PWMW_LEVEL(stcPwmLevel.u32PwmWLvl));

    u32Pwmlv0 = stcPwmLevel.u32PwmULvl | stcPwmLevel.u32PwmVLvl | stcPwmLevel.u32PwmWLvl;

    WRITE_REG32(M4_EMB->PWMLV0, u32Pwmlv0);
}

/**
 * @brief  Set Timerb PWM port output state when EMB event occurs
 * @param  [in] u32OutputState          Timerb PWM port output state
 *         This parameter can be one of the following values:
 *           @arg EMB_SET_TMRB_PWM_OUTPUT_NORMAL: TIMB_1_PWMn(n=1~4) output normal
 *           @arg EMB_SET_TMRB_PWM_OUTPUT_HIZ:    TIMB_1_PWMn(n=1~4) output Hi-z
 *           @arg EMB_SET_TMRB_PWM_OUTPUT_LOW:    TIMB_1_PWMn(n=1~4) output low level
 *           @arg EMB_SET_TMRB_PWM_OUTPUT_HIGH:   TIMB_1_PWMn(n=1~4) output high level
 * @retval None
 */
void EMB_SetTimerbOutputState(uint32_t u32OutputState)
{
    DDL_ASSERT(IS_VALID_EMB_SET_TMRB_PWM_OUTPUT_STATE(u32OutputState));

    WRITE_REG32(M4_EMB->ECSR, u32OutputState);
}

/**
 * @brief  Set the EMB interrupt function
 * @param  [in] u32Group                EMB group
 *         This parameter can be one of the following values:
 *           @arg EMB_GROUP0_TMR4:      EMB group 0 for Timer4
 *           @arg EMB_GROUP1_TMRB:      EMB group 1 for TimerB
 * @param  [in] u32IntSource            EMB interrupt source
 *         This parameter can be one of the following values:
 *           @arg EMB_INT_PWM:          PWM same phase trigger stop PWM
 *           @arg EMB_INT_CMP:          CMP trigger stop PWM
 *           @arg EMB_INT_OSC:          OSC trigger stop PWM
 *           @arg EMB_INT_PORT_EMBIN1:  Port EMB_IN1 stop PWM
 *           @arg EMB_INT_PORT_EMBIN2:  Port EMB_IN2 stop PWM
 *           @arg EMB_INT_PORT_EMBIN3:  Port EMB_IN3 stop PWM
 * @param  [in] enNewSta                The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void EMB_IntCmd(uint32_t u32Group,
                    uint32_t u32IntSource,
                    en_functional_state_t enNewSta)
{
    __IO uint32_t *EMB_INTEN = EMB_INTENx(u32Group);

    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB_GROUP(u32Group));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));
    DDL_ASSERT(IS_VALID_EMB_INT(u32IntSource));

    MODIFY_REG32(*EMB_INTEN, u32IntSource, enNewSta);
}

/**
 * @brief  Get EMB status
 * @param  [in] u32Group                EMB group
 *         This parameter can be one of the following values:
 *           @arg EMB_GROUP0_TMR4:      EMB group 0 for Timer4
 *           @arg EMB_GROUP1_TMRB:      EMB group 1 for TimerB
 * @param  [in] u32Status               EMB flag
 *         This parameter can be one of the following values:
 *           @arg EMB_FLAG_PWM:  PWM same phase trigger stop PWM
 *           @arg EMB_FLAG_CMP: CMP trigger stop PWM
 *           @arg EMB_FLAG_OSC: OSC trigger stop PWM
 *           @arg EMB_FLAG_PORT_EMBIN1: Port EMB_IN1 input trigger stop PWM
 *           @arg EMB_FLAG_PORT_EMBIN2: Port EMB_IN1 input trigger stop PWM
 *           @arg EMB_FLAG_PORT_EMBIN3: Port EMB_IN1 input trigger stop PWM
 *           @arg EMB_FLAG_PWM_STATE: PWM same phase occur
 *           @arg EMB_FLAG_PORT_EMBIN1_STATE: Port EMB_IN1 input control state
 *           @arg EMB_FLAG_PORT_EMBIN2_STATE: Port EMB_IN2 input control state
 *           @arg EMB_FLAG_PORT_EMBIN3_STATE: Port EMB_IN3 input control state
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t EMB_GetStatus(uint32_t u32Group, uint32_t u32Status)
{
    __IO uint32_t *EMB_STAT = EMB_STATx(u32Group);

    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB_GROUP(u32Group));
    DDL_ASSERT(IS_VALID_EMB_FLAG(u32Status));

    return READ_REG32_BIT(*EMB_STAT, u32Status) ? Set : Reset;
}

/**
 * @brief  Clear EMB status
 * @param  [in] u32Group                EMB group
 *         This parameter can be one of the following values:
 *           @arg EMB_GROUP0_TMR4:      EMB group 0 for Timer4
 *           @arg EMB_GROUP1_TMRB:      EMB group 1 for TimerB
 * @param  [in] u32Status           EMB status
 *         This parameter can be one of the following values:
 *           @arg EMB_FLAG_PWM:  PWM same phase trigger stop PWM
 *           @arg EMB_FLAG_CMP: CMP trigger stop PWM
 *           @arg EMB_FLAG_OSC: OSC trigger stop PWM
 *           @arg EMB_FLAG_PORT_EMBIN1: Port EMB_IN1 input trigger stop PWM
 *           @arg EMB_FLAG_PORT_EMBIN2: Port EMB_IN1 input trigger stop PWM
 *           @arg EMB_FLAG_PORT_EMBIN3: Port EMB_IN1 input trigger stop PWM
 * @retval None
 */
void EMB_ClearStatus(uint32_t u32Group, uint32_t u32Status)
{
    __IO uint32_t *EMB_STAT = EMB_STATx(u32Group);

    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB_GROUP(u32Group));
    DDL_ASSERT(IS_VALID_EMB_FLAG(u32Status));

    SET_REG32_BIT(*EMB_STAT, u32Status);
}

/**
 * @brief  EMB software brake
 * @param  [in] u32Group                EMB group
 *         This parameter can be one of the following values:
 *           @arg EMB_GROUP0_TMR4:      EMB group 0 for Timer4
 *           @arg EMB_GROUP1_TMRB:      EMB group 1 for TimerB
 * @param  [in] enNewSta                The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void EMB_SwBrake(uint32_t u32Group, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_EMB_GROUP(u32Group));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (EMB_GROUP0_TMR4 == u32Group)
    {
        WRITE_REG32(bM4_EMB->SOE0_b.SOE, enNewSta);
    }
    else
    {
        WRITE_REG32(bM4_EMB->SOE1_b.SOE, enNewSta);
    }
}

/**
 * @}
 */

#endif /* DDL_EMB_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
